Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32N657/Includes/Registers/soc_vectors.h
/*
SPDX-License-Identifier: MIT
SPDX-FileCopyrightText: 2025-2026 Edo. Franzi
*/

/*
; soc_vectors.
; ============

;------------------------------------------------------------------------
; Author:	Generated using the .svd description	The 2025-01-01
; Modifs:
;
; Project:	uKOS-X
; Goal:		Indirect Exception Vectors for Cortex_M55.
;			The "reset" exception is not considered. The indirect table
;			is reserved in the first.c file.
;
;   (c) 2025-2026, Edo. Franzi
;   --------------------------
;                                              __ ______  _____
;   Edo. Franzi                         __  __/ //_/ __ \/ ___/
;   5-Route de Cheseaux                / / / / ,< / / / /\__ \
;   CH 1400 Cheseaux-Noréaz           / /_/ / /| / /_/ /___/ /
;                                     \__,_/_/ |_\____//____/
;   edo.franzi@ukos.ch
;
;   Description: Lightweight, real-time multitasking operating
;   system for embedded microcontroller and DSP-based systems.
;
;   Permission is hereby granted, free of charge, to any person
;   obtaining a copy of this software and associated documentation
;   files (the "Software"), to deal in the Software without restriction,
;   including without limitation the rights to use, copy, modify,
;   merge, publish, distribute, sublicense, and/or sell copies of the
;   Software, and to permit persons to whom the Software is furnished
;   to do so, subject to the following conditions:
;
;   The above copyright notice and this permission notice shall be
;   included in all copies or substantial portions of the Software.
;
;   THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND,
;   EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF
;   MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND
;   NONINFRINGEMENT. IN NO EVENT SHALL THE AUTHORS OR COPYRIGHT HOLDERS
;   BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER LIABILITY, WHETHER IN AN
;   ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM, OUT OF OR IN
;   CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE
;   SOFTWARE.
;
;------------------------------------------------------------------------
*/

#pragma	once

typedef enum IRQn {

// Cortex_M55 Processor Exceptions Numbers

	NonMaskableInt_IRQn		= -14,	// Non Maskable Interrupt
	HardFault_IRQn			= -13,	// Hard Fault Interrupt
	MemoryManagement_IRQn	= -12,	// Memory Management Interrupt
	BusFault_IRQn			= -11,	// Bus Fault Interrupt
	UsageFault_IRQn			= -10,	// Usage Fault Interrupt
	SecureFault_IRQn		= -9,	// Secure Fault
	SVCall_IRQn				= -5,	// SV Call Interrupt
	DebugMonitor_IRQn		= -4,	// Debug Monitor Interrupt
	PendSV_IRQn				= -2,	// Pend SV Interrupt
	SysTick_IRQn			= -1,	// System Tick Interrupt

// SOC Specific Interrupt Numbers

	PVD_PVM_IRQn			= 0,	// PVDOUT through the EXTI line
	DTS_IRQn				= 2,	// Thermal sensor interruption
	RCC_IRQn				= 3,	// RCC global interrupt
	LOCKUP_IRQn				= 4,	// LOCKUP - no overstack in Cortex-M55
	CACHE_ECC_IRQn			= 5,	// Cache ECC error
	TCM_ECC_IRQn			= 6,	// TCM ECC error
	BCK_ECC_IRQn			= 7,	// Backup RAM interrupts (SEC and DED)
	FPU_IRQn				= 8,	// FPU safety flag
	RTC_S_IRQn				= 10,	// RTC secure interrupt
	TAMP_IRQn				= 11,	// TAMP secure and non-secure synchronous interrupt line
	RIFSC_TAMPER_IRQn		= 12,	// RIF can generate an interrupt when a laser attack is detected
	IAC_IRQn				= 13,	// IAC global interrupt
	RCC_S_IRQn				= 14,	// RCC global secure interrupt
	RTC_IRQn				= 16,	// RTC interrupt
	WDGLS_EARLY_IRQn		= 18,	// Independent watchdog interrupt
	WWDG_EARLY_IRQn			= 19,	// Window watchdog interrupt
	EXTI0_IRQn				= 20,	// EXTI Line 0 interrupt through the EXTI line
	EXTI1_IRQn				= 21,	// EXTI Line 1 interrupt through the EXTI line
	EXTI2_IRQn				= 22,	// EXTI Line 2 interrupt through the EXTI line
	EXTI3_IRQn				= 23,	// EXTI Line 3 interrupt through the EXTI line
	EXTI4_IRQn				= 24,	// EXTI Line 4 interrupt through the EXTI line
	EXTI5_IRQn				= 25,	// EXTI Line 5 interrupt through the EXTI line
	EXTI6_IRQn				= 26,	// EXTI Line 6 interrupt through the EXTI line
	EXTI7_IRQn				= 27,	// EXTI Line 7 interrupt through the EXTI line
	EXTI8_IRQn				= 28,	// EXTI Line 8 interrupt through the EXTI line
	EXTI9_IRQn				= 29,	// EXTI Line 9 interrupt
	EXTI10_IRQn				= 30,	// EXTI Line 10 interrupt
	EXTI11_IRQn				= 31,	// EXTI Line 11 interrupt
	EXTI12_IRQn				= 32,	// EXTI Line 12 interrupt
	EXTI13_IRQn				= 33,	// EXTI Line 13 interrupt
	EXTI14_IRQn				= 34,	// EXTI Line 14 interrupt
	EXTI15_IRQn				= 35,	// EXTI Line 15 interrupt
	SAES_IRQn				= 36,	// SAES global interrupt
	CRYP_IRQn				= 37,	// CRYP global interrupt
	PKA_IRQn				= 38,	// PKA global interrupt
	HASH_IRQn				= 39,	// HASH global interrupt
	RNG_IRQn				= 40,	// RNG global interrupt
	MCE1_IRQn				= 42,	// MCE1 global interrupt
	MCE2_IRQn				= 43,	// MCE2 global interrupt
	MCE3_IRQn				= 44,	// MCE3 global interrupt
	MCE4_IRQn				= 45,	// MCE4 global interrupt
	ADC12_IRQn				= 46,	// ADC1/ADC2 global interrupt
	CSI_DBG_IRQn			= 47,	// CSI global interrupt
	DCMIPP_IRQn				= 48,	// DCMIPP global interrupt
	PAHB_ERR_IRQn			= 52,	// Write posting errors on Cortex-M55 PAHB interface
	NPU_END_OF_EPOCH_IRQn	= 53,	// NPU mst_ints[0] line
	NPU1_IRQn				= 54,	// NPU mst_ints[1] line
	NPU2_IRQn				= 55,	// NPU mst_ints[2] line
	NPU3_IRQn				= 56,	// NPU mst_ints[3] line
	NPUCACHE_IRQn			= 57,	// ATON interrupt cache
	LTDC_LO_IRQn			= 58,	// LCD low-layer global interrupt
	LTDC_LO_ERR_IRQn		= 59,	// LCD low-layer error interrupt
	DMA2D_IRQn				= 60,	// DMA2D global interrupt
	JPEG_IRQn				= 61,	// JPEG global interrupt
	VENC_IRQn				= 62,	// VENC global interrupt
	GFXMMU_IRQn				= 63,	// GFXMMU global interrupt
	GFXTIM_IRQn				= 64,	// GFXTIM global interrupt
	GPU2D_IRQn				= 65,	// GPU2D global interrupt
	GPU2D_ERROR_IRQn		= 66,	// GPU2D global interrupt
	GPU_CACHE_IRQn			= 67,	// GPU cache interrupt
	HPDMA1_CH0_IRQn			= 68,	// HPDMA1 Channel 0 interrupt
	HPDMA1_CH1_IRQn			= 69,	// HPDMA1 Channel 1 interrupt
	HPDMA1_CH2_IRQn			= 70,	// HPDMA1 Channel 2 interrupt
	HPDMA1_CH3_IRQn			= 71,	// HPDMA1 Channel 3 interrupt
	HPDMA1_CH4_IRQn			= 72,	// HPDMA1 Channel 4 interrupt
	HPDMA1_CH5_IRQn			= 73,	// HPDMA1 Channel 5 interrupt
	HPDMA1_CH6_IRQn			= 74,	// HPDMA1 Channel 6 interrupt
	HPDMA1_CH7_IRQn			= 75,	// HPDMA1 Channel 7 interrupt
	HPDMA1_CH8_IRQn			= 76,	// HPDMA1 Channel 8 interrupt
	HPDMA1_CH9_IRQn			= 77,	// HPDMA1 Channel 9 interrupt
	HPDMA1_CH10_IRQn		= 78,	// HPDMA1 Channel 10 interrupt
	HPDMA1_CH11_IRQn		= 79,	// HPDMA1 Channel 11 interrupt
	HPDMA1_CH12_IRQn		= 80,	// HPDMA1 Channel 12 interrupt
	HPDMA1_CH13_IRQn		= 81,	// HPDMA1 Channel 13 interrupt
	HPDMA1_CH14_IRQn		= 82,	// HPDMA1 Channel 14 interrupt
	HPDMA1_CH15_IRQn		= 83,	// HPDMA1 Channel 15 interrupt
	GPDMA1_CH0_IRQn			= 84,	// GPDMA1 channel 0 interrupt
	GPDMA1_CH1_IRQn			= 85,	// GPDMA1 channel 1 interrupt
	GPDMA1_CH2_IRQn			= 86,	// GPDMA1 channel 2 interrupt
	GPDMA1_CH3_IRQn			= 87,	// GPDMA1 channel 3 interrupt
	GPDMA1_CH4_IRQn			= 88,	// GPDMA1 channel 4 interrupt
	GPDMA1_CH5_IRQn			= 89,	// GPDMA1 channel 5 interrupt
	GPDMA1_CH6_IRQn			= 90,	// GPDMA1 channel 6 interrupt
	GPDMA1_CH7_IRQn			= 91,	// GPDMA1 channel 7 interrupt
	GPDMA1_CH8_IRQn			= 92,	// GPDMA1 channel 8 interrupt
	GPDMA1_CH9_IRQn			= 93,	// GPDMA1 channel 9 interrupt
	GPDMA1_CH10_IRQn		= 94,	// GPDMA1 channel 10 interrupt
	GPDMA1_CH11_IRQn		= 95,	// GPDMA1 channel 11 interrupt
	GPDMA1_CH12_IRQn		= 96,	// GPDMA1 channel 12 interrupt
	GPDMA1_CH13_IRQn		= 97,	// GPDMA1 channel 13 interrupt
	GPDMA1_CH14_IRQn		= 98,	// GPDMA1 channel 14 interrupt
	GPDMA1_CH15_IRQn		= 99,	// GPDMA1 channel 15 interrupt
	I2C1_EV_IRQn			= 100,	// I2C1 event interrupt
	I2C1_ER_IRQn			= 101,	// I2C1 error interrupt
	I2C2_EV_IRQn			= 102,	// I2C2 event interrupt
	I2C2_ER_IRQn			= 103,	// I2C2 error interrupt
	I2C3_EV_IRQn			= 104,	// I2C3 event interrupt
	I2C3_ER_IRQn			= 105,	// I2C3 error interrupt
	I2C4_EV_IRQn			= 106,	// I2C4 event interrupt
	I2C4_ER_IRQn			= 107,	// I2C4 error interrupt
	I3C1_EV_IRQn			= 108,	// I3C1 event interrupt
	I3C1_ER_IRQn			= 109,	// I3C1 error interrupt
	I3C2_EV_IRQn			= 110,	// I3C2 event interrupt
	I3C2_ER_IRQn			= 111,	// I3C2 error interrupt
	TIM1_BRK_IRQn			= 112,	// TIM1 Break interrupt
	TIM1_UP_IRQn			= 113,	// TIM1 Update interrupt
	TIM1_TRG_CCU_IRQn		= 114,	// TIM1 Trigger and Commutation interrupts
	TIM1_CC_IRQn			= 115,	// TIM1 Capture Compare interrupt
	TIM2_IRQn				= 116,	// TIM2 global interrupt
	TIM3_IRQn				= 117,	// TIM3 global interrupt
	TIM4_IRQn				= 118,	// TIM4 global interrupt
	TIM5_IRQn				= 119,	// TIM5 global interrupt
	TIM6_IRQn				= 120,	// TIM6 Global interrupt
	TIM7_IRQn				= 121,	// TIM7 Global interrupt
	TIM8_BRK_IRQn			= 122,	// TIM8 Break interrupt
	TIM8_UP_IRQn			= 123,	// TIM8 Update interrupt
	TIM8_TRG_CCU_IRQn		= 124,	// TIM8 Trigger and Commutation interrupts
	TIM8_CC_IRQn			= 125,	// TIM8 Capture Compare interrupt
	TIM9_IRQn				= 126,	// TIM9 Global interrupt
	TIM10_IRQn				= 127,	// TIM10 Global interrupt
	TIM11_IRQn				= 128,	// TIM11 Global interrupt
	TIM12_IRQn				= 129,	// TIM12 Global interrupt
	TIM13_IRQn				= 130,	// TIM13 Global interrupt
	TIM14_IRQn				= 131,	// TIM14 Global interrupt
	TIM15_IRQn				= 132,	// TIM15 global interrupt
	TIM16_IRQn				= 133,	// TIM16 global interrupt
	TIM17_IRQn				= 134,	// TIM17 global interrupt
	TIM18_IRQn				= 135,	// TIM18 Global interrupt
	LPTIM1_IRQn				= 136,	// LPTIM1 global interrupt
	LPTIM2_IRQn				= 137,	// LPTIM2 global interrupt
	LPTIM3_IRQn				= 138,	// LPTIM3 global interrupt
	LPTIM4_IRQn				= 139,	// LPTIM4 global interrupt
	LPTIM5_IRQn				= 140,	// LPTIM5 global interrupt
	ADF1_FLT0_IRQn			= 141,	// ADF1 filter 0 global interrupt
	MDF1_FLT0_IRQn			= 142,	// MDF global Interrupt for Filter0
	MDF1_FLT1_IRQn			= 143,	// MDF global Interrupt for Filter1
	MDF1_FLT2_IRQn			= 144,	// MDF global Interrupt for Filter2
	MDF1_FLT3_IRQn			= 145,	// MDF global Interrupt for Filter3
	MDF1_FLT4_IRQn			= 146,	// MDF global Interrupt for Filter4
	MDF1_FLT5_IRQn			= 147,	// MDF global Interrupt for Filter5
	SAI1_A_IRQn				= 148,	// SAI1 global interrupt A
	SAI1_B_IRQn				= 149,	// SAI1 global interrupt B
	SAI2_A_IRQn				= 150,	// SAI2 global interrupt A
	SAI2_GLOBAL_B_IRQn		= 151,	// SAI2 global interrupt B
	SPDIFRX_IRQn			= 152,	// SPDIFRX global interrupt
	SPI1_IRQn				= 153,	// SPI1 global interrupt A
	SPI2_IRQn				= 154,	// SPI2 global interrupt A
	SPI3_IRQn				= 155,	// SPI3 global interrupt A
	SPI4_IRQn				= 156,	// SPI4 global interrupt A
	SPI5_IRQn				= 157,	// SPI5 global interrupt A
	SPI6_IRQn				= 158,	// SPI6 global interrupt A
	USART1_IRQn				= 159,	// USART1 Global interrupt
	USART2_IRQn				= 160,	// USART2 Global interrupt
	USART3_IRQn				= 161,	// USART3 Global interrupt
	UART4_IRQn				= 162,	// UART4 Global interrupt
	UART5_IRQn				= 163,	// UART5 Global interrupt
	USART6_IRQn				= 164,	// USART6 Global interrupt
	UART7_IRQn				= 165,	// UART7 Global interrupt
	UART8_IRQn				= 166,	// UART8 Global interrupt
	UART9_IRQn				= 167,	// UART9 Global interrupt
	USART10_IRQn			= 168,	// USART10 Global interrupt
	LPUART1_IRQn			= 169,	// LPUART1 global interrupt
	XSPI1_IRQn				= 170,	// XSPI1 global interrupt
	XSPI2_IRQn				= 171,	// XSPI2 global interrupt
	XSPI3_IRQn				= 172,	// XSPI3 global interrupt
	FMC_IRQn				= 173,	// FMC global interrupt
	SDMMC1_IRQn				= 174,	// SDMMC1 global interrupt
	SDMMC2_IRQn				= 175,	// SDMMC2 global interrupt
	UCPD_IRQn				= 176,	// UCPD global interrupt
	OTG1_IRQn				= 177,	// USB OTG1 HS global interrupt
	OTG2_IRQn				= 178,	// USB OTG2 HS global interrupt
	ETH1_IRQn				= 179,	// Ethernet global interrupt
	FDCAN1_IT0_IRQn			= 180,	// FDCAN1 interrupt 0
	FDCAN1_IT1_IRQn			= 181,	// FDCAN1 interrupt 1
	FDCAN2_IT0_IRQn			= 182,	// FDCAN2 interrupt 0
	FDCAN2_IT1_IRQn			= 183,	// FDCAN2 interrupt 1
	FDCAN3_IT0_IRQn			= 184,	// FDCAN3 interrupt 0
	FDCAN3_IT1_IRQn			= 185,	// FDCAN3 interrupt 1
	FDCAN_CU_IRQn			= 186,	// Clock calibration unit interrupt line(FDCAN1 only)
	MDIOS_IRQn				= 187,	// MDIOS global Interrupt
	DCMI_PSSI_IRQn			= 188,	// DCMI/PSSI global interrupt
	WAKEUP_PIN_IRQn			= 189,	// Wake-up pin interrupts
	CTI0_IRQn				= 190,	// Debug monitor (Cortex-M55 related)
	CTI1_IRQn				= 191,	// Debug monitor (Cortex-M55 related)
	LTDC_UP_IRQn			= 193,	// LCD up-layer global interrupt
	LTDC_UP_ERR_IRQn		= 194,	// LCD up-layer error interrupt
} IRQn_Type;

#define	KNB_EXCEPTIONS		14U
#define	KNB_INTERRUPTIONS	195U

